Documents/ПоступлениеТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПоступлениеТоваровУслуг</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПоступлениеТоваровУслуг/Forms/ФормаДокументаОбщая/Ext/Form/Module.bsl
&НаКлиенте
Процедура иб_ПослеЗаписиПосле(ПараметрыЗаписи)
	Если НЕ ПустаяСтрока(Объект.НомерВходящегоДокумента) Тогда
		Если ЕстьПохожееПоступление(Объект.Ссылка) Тогда
			ПоказатьОповещениеПользователя("Проверка", 
			НавигационнаяСсылка, 
			"Найдены документы с этим входящим номером по этому контрагенту",
			БиблиотекаКартинок.Информация,
			СтатусОповещенияПользователя.Важное);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ЕстьПохожееПоступление(ДокументПоступления) Экспорт
	
	Если НЕ Константы.ИБ_ПроверятьВходящийНомерПоступлениеТоваровУслуг.Получить() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТоваровУслуг.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|ГДЕ
		|	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.ДатаВходящегоДокумента, ГОД) = &ДатаВходящегоДокумента
		|	И СОКРЛП(ПоступлениеТоваровУслуг.НомерВходящегоДокумента) = &НомерВходящегоДокумента
		|	И ПоступлениеТоваровУслуг.Контрагент = &Контрагент
		|	И НЕ ПоступлениеТоваровУслуг.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("ДатаВходящегоДокумента",	 НачалоГода(ДокументПоступления.ДатаВходящегоДокумента));
	Запрос.УстановитьПараметр("НомерВходящегоДокумента", СокрЛП(ДокументПоступления.НомерВходящегоДокумента));
	Запрос.УстановитьПараметр("Контрагент",				 ДокументПоступления.Контрагент);
	Запрос.УстановитьПараметр("Ссылка",	 				 ДокументПоступления.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции // ЕстьПохожееПоступление()
